; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation9 - direction
	Star2 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	Star3 - direction
	Star6 - direction
	Star10 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	GroundStation12 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star10)
	(supports instrument2 image0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star6)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation12)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
)
(:goal (and
	(have_image Phenomenon14 image0)
	(have_image Star15 thermograph1)
	(have_image Phenomenon16 image0)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
2. (turn_to satellite1 star7 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star7)
   goals met: 0 of 4
3. (calibrate satellite1 instrument3 star7)
   added: (calibrated instrument3)
   goals met: 0 of 4
4. (turn_to satellite1 phenomenon14 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 4
5. (take_image satellite1 phenomenon14 instrument3 image0)
   added: (have_image phenomenon14 image0)
   goals met: 1 of 4
6. (turn_to satellite1 phenomenon16 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 4
7. (take_image satellite1 phenomenon16 instrument3 image0)
   added: (have_image phenomenon16 image0)
   goals met: 2 of 4
8. (turn_to satellite1 phenomenon17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 4
9. (take_image satellite1 phenomenon17 instrument3 image0)
   added: (have_image phenomenon17 image0)
   goals met: 3 of 4
10. (turn_to satellite1 star15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star15)
   goals met: 3 of 4
11. (take_image satellite1 star15 instrument3 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 4 of 4
